Revit 2027 API
BuiltInFailures.DimensionFailures.SpotDimensionFloatingPointError Property
 Some spot dimensions contain invalid floating-point values.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId SpotDimensionFloatingPointError { get; }
Public Shared ReadOnly Property SpotDimensionFloatingPointError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ SpotDimensionFloatingPointError {
	FailureDefinitionId^ get ();
}
static member SpotDimensionFloatingPointError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DimensionFailures Class
Autodesk.Revit.DB Namespace